include/fedex/wsdl/CancelPendingShipmentReques.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/ship/v8">
<SOAP-ENV:Body>
<CancelPendingShipmentRequest>
<WebAuthenticationDetail>
<UserCredential>
<Key></Key>
<Password></Password>
</UserCredential>
</WebAuthenticationDetail>
<ClientDetail>
<AccountNumber></AccountNumber>
<MeterNumber></MeterNumber>
</ClientDetail>
<TransactionDetail>
<CustomerTransactionId>String</CustomerTransactionId>
</TransactionDetail>
<Version>
<ServiceId>ship</ServiceId>
<Major>8</Major>
<Intermediate>0</Intermediate>
<Minor>0</Minor>
</Version>
<TrackingNumber>794817814031</TrackingNumber>
</CancelPendingShipmentRequest>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>